In [2]:
import pandas as pd
import numpy as np

# SERİSES

In [5]:
myDic = {"benj" : 23 , "kemal" : 60 ,"tarık ": 35}

In [6]:
pd.Series(myDic)

benj      23
kemal     60
tarık     35
dtype: int64

In [32]:
myList = list(np.random.randint(0,25,8))

In [33]:
pd.Series(myList)

0    20
1    24
2    13
3    11
4    19
5    22
6    13
7    16
dtype: int32

In [34]:
npDizi = np.array(myList)

In [35]:
npDizi

array([20, 24, 13, 11, 19, 22, 13, 16])

In [37]:
pd.Series(npDizi)

0    20
1    24
2    13
3    11
4    19
5    22
6    13
7    16
dtype: int32

In [38]:
a1 = pd.Series(index=["ali","kemal","fatma"],data = [10,20,50])

In [45]:
a2 = pd.Series(index=["ali","kemal","fatma","murat"] , data = [20,30,10,100])

In [46]:
result = a1 + a2

In [47]:
result

ali      30.0
fatma    60.0
kema      NaN
kemal     NaN
murat     NaN
dtype: float64

# dataframe

In [81]:
data = np.random.randn(4,3)

In [82]:
data

array([[-1.14188905,  2.16613868,  0.83194637],
       [-0.75641991, -1.46302914, -2.16569898],
       [ 0.50982999, -0.98259541, -0.02364913],
       [-1.84752117, -0.06198269, -0.5692702 ]])

In [85]:
dataFrame = pd.DataFrame(data)

In [86]:
dataFrame

          0         1         2
0 -1.141889  2.166139  0.831946
1 -0.756420 -1.463029 -2.165699
2  0.509830 -0.982595 -0.023649
3 -1.847521 -0.061983 -0.569270

In [95]:
newDataFrame = pd.DataFrame(data,index=["ali","kemal","necip","ben"],columns =["maas","yas","ayakkabı numarası"] )

In [99]:
newDataFrame

           maas       yas  ayakkabı numarası
ali   -1.141889  2.166139           0.831946
kemal -0.756420 -1.463029          -2.165699
necip  0.509830 -0.982595          -0.023649
ben   -1.847521 -0.061983          -0.569270

In [104]:
newDataFrame[["maas","yas"]]

           maas       yas
ali   -1.141889  2.166139
kemal -0.756420 -1.463029
necip  0.509830 -0.982595
ben   -1.847521 -0.061983

In [105]:
newDataFrame.loc["ali"]

maas                -1.141889
yas                  2.166139
ayakkabı numarası    0.831946
Name: ali, dtype: float64

In [109]:
myList0 =[0.64165,0.54949,0.51981,0.9864]

In [110]:
newDataFrame["belCevresi"]=myList0

In [111]:
newDataFrame

           maas       yas  ayakkabı numarası  belCevresi
ali   -1.141889  2.166139           0.831946     0.64165
kemal -0.756420 -1.463029          -2.165699     0.54949
necip  0.509830 -0.982595          -0.023649     0.51981
ben   -1.847521 -0.061983          -0.569270     0.98640

In [115]:
newDataFrame.drop("ayakkabı numarası",axis = 1 ,inplace = True)

In [116]:
newDataFrame

           maas       yas  belCevresi
ali   -1.141889  2.166139     0.64165
kemal -0.756420 -1.463029     0.54949
necip  0.509830 -0.982595     0.51981
ben   -1.847521 -0.061983     0.98640

In [117]:
newDataFrame.loc["ali"]["yas"]

2.166138675393653

In [121]:
newDataFrame >0

        maas    yas  belCevresi
ali    False   True        True
kemal  False  False        True
necip   True  False        True
ben    False  False        True

In [122]:
newDataFrame[newDataFrame["yas"]> 0]

         maas       yas  belCevresi
ali -1.141889  2.166139     0.64165

In [123]:
newDataFrame.reset_index()

   index      maas       yas  belCevresi
0    ali -1.141889  2.166139     0.64165
1  kemal -0.756420 -1.463029     0.54949
2  necip  0.509830 -0.982595     0.51981
3    ben -1.847521 -0.061983     0.98640

In [124]:
newData

NameError: name 'newData' is not defined

In [125]:
newİndexList = ["a","k","n","b"]

In [127]:
newDataFrame["newİndex"]=newİndexList

In [129]:
newDataFrame.set_index("newİndex")

              maas       yas  belCevresi
newİndex
a        -1.141889  2.166139     0.64165
k        -0.756420 -1.463029     0.54949
n         0.509830 -0.982595     0.51981
b        -1.847521 -0.061983     0.98640